In [1]:
import pandas as pd

In [4]:
titanic_df=pd.read_csv('C:/Users/채윤병/ESAA/titanic_train.csv')
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [6]:
#1. 데이터 조회
titanic_df.shape
# 행, 열

(891, 12)

In [8]:
titanic_df.info()
# 총 데이터 건수, 데이터 타입, Null 건수

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [9]:
titanic_df.describe()
# 숫자형 칼럼의 분포도만 조사, object은 자동 제외

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [14]:
titanic_df['Pclass'].value_counts() 
# 지정된 칼럼의 데이터값 건수 반환
# series 객체에서만 정의

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [16]:
print(type(titanic_df["Pclass"]))
titanic_pclass=titanic_df["Pclass"]
# series 객체로 반환
## index와 단 하나의 칼럼으로 구성된 데이터 세트

<class 'pandas.core.series.Series'>

In [17]:
titanic_pclass.head()
# index, 데이터 값

0    3
1    1
2    3
3    1
4    3
Name: Pclass, dtype: int64

In [18]:
value_counts=titanic_df['Pclass'].value_counts()
print(type(value_counts))
print(value_counts)
# 여기서 인덱스는 의미 있는 데이터값

<class 'pandas.core.series.Series'>
3    491
1    216
2    184
Name: Pclass, dtype: int64

In [20]:
#2. dataframe와 리스트, 딕셔너리, 넘파이 ndarray의 상호변환
## ->df
import numpy as np
col_name1=['col1']
list1=[1,2,3]
array1=np.array(list1)
print(array1.shape)

(3,)

In [22]:
#리스트->df
df_list1=pd.DataFrame(list1,columns=col_name1)
#넘파이->df
df_array1=pd.DataFrame(array1, columns=col_name1)
print(df_list1)
print(df_array1)

   col1
0     1
1     2
2     3
   col1
0     1
1     2
2     3

In [24]:
col_name2=['col1','col2','col3']
list2=[[1,2,3],
       [11,12,13]]
array2=np.array(list2)
print(array2.shape)

#리스트->df
df_list2=pd.DataFrame(list2,columns=col_name2)
#넘파이->df
df_array2=pd.DataFrame(array2, columns=col_name2)
print(df_list2)
print(df_array2)
#pd.DataFrame(data, columns=컬럼명)

(2, 3)
   col1  col2  col3
0     1     2     3
1    11    12    13
   col1  col2  col3
0     1     2     3
1    11    12    13

In [26]:
#딕셔너리->df
dict={'col1':[1,11],'col2':[2,22],'col3':[3,33]}
df_dict=pd.DataFrame(dict)
df_dict
#키-> 칼럼명, 값-> 칼럼 데이터

   col1  col2  col3
0     1     2     3
1    11    22    33

In [28]:
##df->
#dataframe 객체의 values 활용
#df->넘파이
array3=df_dict.values
print(type(array3), array3.shape, array3)

<class 'numpy.ndarray'> (2, 3) [[ 1  2  3]
 [11 22 33]]

In [30]:
#df->리스트
list3=df_dict.values.tolist()
print(list3)
print(type(list3))

#df->딕셔너리
dict3=df_dict.to_dict('list') #값이 list로 반환
print(dict3)
print(type(dict3))

[[1, 2, 3], [11, 22, 33]]
<class 'list'>
{'col1': [1, 11], 'col2': [2, 22], 'col3': [3, 33]}
<class 'dict'>

In [31]:
# df의 칼럼 생성과 수정
titanic_df['Age0']=0
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age0
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0

In [32]:
titanic_df['Age_by_10']=titanic_df['Age']*10
titanic_df['Family_No']=titanic_df['SibSp']+titanic_df['Parch']+1
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,220.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,380.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,260.0,1

In [33]:
titanic_df['Age_by_10']=titanic_df['Age_by_10']+100
titanic_df.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age0,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,360.0,1

In [35]:
#3. df 삭제
#df.drop(labels=None, axis=0, inplace=False)
# axis 0 : 행, axis 1 : 열
titanic_drop_df=titanic_df.drop('Age0',axis=1)
titanic_drop_df.head(3)
#inplace = True : 자신의 df 삭제, 반환값 None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Age_by_10,Family_No
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,320.0,2
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,480.0,2
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,360.0,1

In [36]:
drop_result=titanic_df.drop(['Age0','Age_by_10','Family_No'], axis=1, inplace=True)
print(drop_result)
titanic_df.head(3)

None

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [37]:
titanic_df.drop([0,1,2], axis=0,inplace=True)
print(titanic_df.head(3))

   PassengerId  Survived  Pclass  \
3            4         1       1
4            5         0       3
5            6         0       3

                                           Name     Sex   Age  SibSp  Parch  \
3  Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1      0
4                      Allen, Mr. William Henry    male  35.0      0      0
5                              Moran, Mr. James    male   NaN      0      0

   Ticket     Fare Cabin Embarked
3  113803  53.1000  C123        S
4  373450   8.0500   NaN        S
5  330877   8.4583   NaN        Q

In [39]:
#4. index 객체
titanic_df=pd.read_csv('C:/Users/채윤병/ESAA/titanic_train.csv')
indexes=titanic_df.index
print(indexes.values)

[  0   1   2   3   4   5   6   7   8   9  10  11  12  13  14  15  16  17
  18  19  20  21  22  23  24  25  26  27  28  29  30  31  32  33  34  35
  36  37  38  39  40  41  42  43  44  45  46  47  48  49  50  51  52  53
  54  55  56  57  58  59  60  61  62  63  64  65  66  67  68  69  70  71
  72  73  74  75  76  77  78  79  80  81  82  83  84  85  86  87  88  89
  90  91  92  93  94  95  96  97  98  99 100 101 102 103 104 105 106 107
 108 109 110 111 112 113 114 115 116 117 118 119 120 121 122 123 124 125
 126 127 128 129 130 131 132 133 134 135 136 137 138 139 140 141 142 143
 144 145 146 147 148 149 150 151 152 153 154 155 156 157 158 159 160 161
 162 163 164 165 166 167 168 169 170 171 172 173 174 175 176 177 178 179
 180 181 182 183 184 185 186 187 188 189 190 191 192 193 194 195 196 197
 198 199 200 201 202 203 204 205 206 207 208 209 210 211 212 213 214 215
 216 217 218 219 220 221 222 223 224 225 226 227 228 229 230 231 232 233
 234 235 236 237 238 239 240 241 242 243 244 245 246 247 248 249 250 251
 252 253 254 255 256 257 258 259 260 261 262 263 264 265 266 267 268 269
 270 271 272 273 274 275 276 277 278 279 280 281 282 283 284 285 286 287
 288 289 290 291 292 293 294 295 296 297 298 299 300 301 302 303 304 305
 306 307 308 309 310 311 312 313 314 315 316 317 318 319 320 321 322 323
 324 325 326 327 328 329 330 331 332 333 334 335 336 337 338 339 340 341
 342 343 344 345 346 347 348 349 350 351 352 353 354 355 356 357 358 359
 360 361 362 363 364 365 366 367 368 369 370 371 372 373 374 375 376 377
 378 379 380 381 382 383 384 385 386 387 388 389 390 391 392 393 394 395
 396 397 398 399 400 401 402 403 404 405 406 407 408 409 410 411 412 413
 414 415 416 417 418 419 420 421 422 423 424 425 426 427 428 429 430 431
 432 433 434 435 436 437 438 439 440 441 442 443 444 445 446 447 448 449
 450 451 452 453 454 455 456 457 458 459 460 461 462 463 464 465 466 467
 468 469 470 471 472 473 474 475 476 477 478 479 480 481 482 483 484 485
 486 487 488 489 490 491 492 493 494 495 496 497 498 499 500 501 502 503
 504 505 506 507 508 509 510 511 512 513 514 515 516 517 518 519 520 521
 522 523 524 525 526 527 528 529 530 531 532 533 534 535 536 537 538 539
 540 541 542 543 544 545 546 547 548 549 550 551 552 553 554 555 556 557
 558 559 560 561 562 563 564 565 566 567 568 569 570 571 572 573 574 575
 576 577 578 579 580 581 582 583 584 585 586 587 588 589 590 591 592 593
 594 595 596 597 598 599 600 601 602 603 604 605 606 607 608 609 610 611
 612 613 614 615 616 617 618 619 620 621 622 623 624 625 626 627 628 629
 630 631 632 633 634 635 636 637 638 639 640 641 642 643 644 645 646 647
 648 649 650 651 652 653 654 655 656 657 658 659 660 661 662 663 664 665
 666 667 668 669 670 671 672 673 674 675 676 677 678 679 680 681 682 683
 684 685 686 687 688 689 690 691 692 693 694 695 696 697 698 699 700 701
 702 703 704 705 706 707 708 709 710 711 712 713 714 715 716 717 718 719
 720 721 722 723 724 725 726 727 728 729 730 731 732 733 734 735 736 737
 738 739 740 741 742 743 744 745 746 747 748 749 750 751 752 753 754 755
 756 757 758 759 760 761 762 763 764 765 766 767 768 769 770 771 772 773
 774 775 776 777 778 779 780 781 782 783 784 785 786 787 788 789 790 791
 792 793 794 795 796 797 798 799 800 801 802 803 804 805 806 807 808 809
 810 811 812 813 814 815 816 817 818 819 820 821 822 823 824 825 826 827
 828 829 830 831 832 833 834 835 836 837 838 839 840 841 842 843 844 845
 846 847 848 849 850 851 852 853 854 855 856 857 858 859 860 861 862 863
 864 865 866 867 868 869 870 871 872 873 874 875 876 877 878 879 880 881
 882 883 884 885 886 887 888 889 890]

In [44]:
print(type(indexes.values))
print(indexes.values.shape)
print(indexes[:5].values)
print(indexes[2])

<class 'numpy.ndarray'>
(891,)
[0 1 2 3 4]
2

In [45]:
indexes[0]=5
#index 객체는 함부로 변경 불가, index는 연산용이아니라 식별용

TypeError: Index does not support mutable operations

In [48]:
series_fair=titanic_df['Fare']
print(series_fair.max())
print(sum(series_fair))
print((series_fair+3).head(3))

512.3292
28693.949299999967
0    10.2500
1    74.2833
2    10.9250
Name: Fare, dtype: float64

In [49]:
# reset_index() : 인덱스를 연속된 int 숫자형 데이터로 만들어준다. , drop=True -> 기존 인덱스 삭제
values_counts=titanic_df['Pclass'].value_counts()
print(values_counts)
print(type(values_counts))
new = values_counts.reset_index(inplace=False)
print(new)
print(type(new))

3    491
1    216
2    184
Name: Pclass, dtype: int64
<class 'pandas.core.series.Series'>
   index  Pclass
0      3     491
1      1     216
2      2     184
<class 'pandas.core.frame.DataFrame'>

In [51]:
#5. 데이터 셀렉션, 필터링
# 넘파이의 [] 에는 행, 열 위치, 슬라이싱 범위 
# df의 []에는 칼럼명, 불린 인덱스, 슬라이싱
print(titanic_df['Pclass'].head(3))
print(titanic_df[['Survived','Pclass']].head(3))
print(titanic_df[0])

0    3
1    1
2    3
Name: Pclass, dtype: int64
   Survived  Pclass
0         0       3
1         1       1
2         1       3

KeyError: 0

In [53]:
print(titanic_df[0:3])
#인덱스 형태로 변환 가능한 표현식

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S

In [55]:
#불린인덱싱
titanic_df[titanic_df['Pclass']==3].head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.250,NaN,S
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.925,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.050,NaN,S

In [62]:
# ix[]
# ix[0,"Pclass"], ix[0,1] -> 칼럼 명칭 기반, 칼럼 위치 기반 인덱싱 모두 가능
# loc[] : 명칭 기반 인덱싱 -> 인덱스나 칼럼명으로 데이터에 접근
# iloc[] : 위치 기반 인덱싱 -> 행, 열의 위치 좌표에만 의존
data={'Name': ['Chulmin','Eunkyung','Jin',"jun"],
        'Year': [2011,2016,2017,2019],
        'Gender': ['M',"F","M","M"]}
data_df=pd.DataFrame(data, index=['one','two','three','four'])
print(data_df)

           Name  Year Gender
one     Chulmin  2011      M
two    Eunkyung  2016      F
three       Jin  2017      M
four        jun  2019      M

In [65]:
data_df.iloc[0,0]
#위치 기반

'Chulmin'

In [72]:
reset=data_df.reset_index()
print(reset)
reset.iloc[0,1]

   index      Name  Year Gender
0    one   Chulmin  2011      M
1    two  Eunkyung  2016      F
2  three       Jin  2017      M
3   four       jun  2019      M

'Chulmin'

In [68]:
data_df.loc['one','Name']
#명칭 기반

'Chulmin'

In [76]:
reset.loc[1,'Name']
reset.loc[0,'Name']
# loc에 슬라이싱 기호는 시작값 ~ 종료값을 의미
print(reset.loc[0:1,'Name'])
print(reset.iloc[0:1,1])

0     Chulmin
1    Eunkyung
Name: Name, dtype: object
0    Chulmin
Name: Name, dtype: object

In [79]:
#불린 인덱싱
# iloc는 불린 인덱싱 제공 X
titanic_df=pd.read_csv('titanic_train.csv')
boolean=titanic_df[titanic_df['Age']>60]
print(type(boolean))
print(boolean.head(5))

<class 'pandas.core.frame.DataFrame'>
     PassengerId  Survived  Pclass                            Name   Sex  \
33            34         0       2           Wheadon, Mr. Edward H  male
54            55         0       1  Ostby, Mr. Engelhart Cornelius  male
96            97         0       1       Goldschmidt, Mr. George B  male
116          117         0       3            Connors, Mr. Patrick  male
170          171         0       1       Van der hoef, Mr. Wyckoff  male

      Age  SibSp  Parch      Ticket     Fare Cabin Embarked
33   66.0      0      0  C.A. 24579  10.5000   NaN        S
54   65.0      0      1      113509  61.9792   B30        C
96   71.0      0      0    PC 17754  34.6542    A5        C
116  70.5      0      0      370369   7.7500   NaN        Q
170  61.0      0      0      111240  33.5000   B19        S

In [82]:
titanic_df[titanic_df['Age']>60][['Name','Age']].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [83]:
titanic_df.loc[titanic_df['Age']>60, ['Name','Age']].head(3)

                              Name   Age
33           Wheadon, Mr. Edward H  66.0
54  Ostby, Mr. Engelhart Cornelius  65.0
96       Goldschmidt, Mr. George B  71.0

In [85]:
titanic_df[(titanic_df['Age']>=60) & (titanic_df['Pclass']==1) & (titanic_df['Sex']=='female')]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
275,276,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S
366,367,1,1,"Warren, Mrs. Frank Manley (Anna Sophia Atkinson)",female,60.0,1,0,110813,75.2500,D37,C
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0000,B28,NaN

In [88]:
#6. 정렬, Aggregation, GroupBy
#sort_values(by=['칼럼명'],ascending=True,inplace=False(반환값 반환))
sorted=titanic_df.sort_values(by=['Name', 'Pclass'])
sorted.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
845,846,0,3,"Abbing, Mr. Anthony",male,42.0,0,0,C.A. 5547,7.55,NaN,S
746,747,0,3,"Abbott, Mr. Rossmore Edward",male,16.0,1,1,C.A. 2673,20.25,NaN,S
279,280,1,3,"Abbott, Mrs. Stanton (Rosa Hunt)",female,35.0,1,1,C.A. 2673,20.25,NaN,S

In [90]:
#min(), max(), sum(), count()
titanic_df.count()

PassengerId    891
Survived       891
Pclass         891
Name           891
Sex            891
Age            714
SibSp          891
Parch          891
Ticket         891
Fare           891
Cabin          204
Embarked       889
dtype: int64

In [92]:
titanic_df[['Age','Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [96]:
# groupby(by='칼럼명')
groupby=titanic_df.groupby(by='Pclass')
print(type(groupby))
print(groupby)

<class 'pandas.core.groupby.generic.DataFrameGroupBy'>
<pandas.core.groupby.generic.DataFrameGroupBy object at 0x000001E81C5402E0>

In [98]:
groupby=titanic_df.groupby('Pclass').count()
print(groupby)
#groupby 대상 칼럼을 제외한 모든 칼럼에 대해 aggregation 함수를 적용

        PassengerId  Survived  Name  Sex  Age  SibSp  Parch  Ticket  Fare  \
Pclass
1               216       216   216  216  186    216    216     216   216
2               184       184   184  184  173    184    184     184   184
3               491       491   491  491  355    491    491     491   491

        Cabin  Embarked
Pclass
1         176       214
2          16       184
3          12       491

In [99]:
#특정 칼럼만 count -> 필터링 거쳐야
groupby=titanic_df.groupby('Pclass')[['PassengerId','Survived']].count()
groupby

        PassengerId  Survived
Pclass
1               216       216
2               184       184
3               491       491

In [104]:
#여러 개의 aggregaion 함수 사용 -> 객체 agg()내에 인자로 함수명 입력
print(   titanic_df.groupby('Pclass')['Age'].agg([max,min])   )
print(   titanic_df.groupby('Pclass').agg( {"Age": min, "SibSp": sum }   )  )

         max   min
Pclass
1       80.0  0.92
2       70.0  0.67
3       74.0  0.42
         Age  SibSp
Pclass
1       0.92     90
2       0.67     74
3       0.42    302

In [109]:
#7. 결손 데이터 처리하기
# isna() : NaN 확인
# fillna() : NaN 대체
titanic_df.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [110]:
titanic_df['Cabin']=titanic_df['Cabin'].fillna('C000')
titanic_df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,C000,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,C000,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,C000,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,C000,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,C000,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,C000,Q

In [111]:
titanic_df['Age']=titanic_df['Age'].fillna(titanic_df['Age'].mean())
titanic_df['Embarked']=titanic_df['Embarked'].fillna('S')
titanic_df.isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [114]:
#8. apply lambda 식으로 데이터 가공
# lambda : 파이썬, 함수형 프로그래밍 지원하기 위해 
def get_square(a):
    return a**2

lambda_square = lambda x : x**2

print(get_square(3))
print(lambda_square(3))
# lambda 입력인자 : 반환값

9
9

In [116]:
## 여러 개의 값을 입력인자로 사용할때 ->map(함수, 데이터)
a=[1,2,3]
squares=map(lambda x : x**2, a)
list(squares)

[1, 4, 9]

In [118]:
titanic_df['Name_len']=titanic_df['Name'].apply(lambda x: len(x))
titanic_df[['Name_len','Name']].head(3)

   Name_len                                               Name
0        23                            Braund, Mr. Owen Harris
1        51  Cumings, Mrs. John Bradley (Florence Briggs Th...
2        22                             Heikkinen, Miss. Laina

In [121]:
titanic_df['Child_Adult']=titanic_df['Age'].apply(lambda x: 'Child' if x <=15 else 'Adult')
titanic_df[['Age','Child_Adult']].head(8)

         Age Child_Adult
0  22.000000       Adult
1  38.000000       Adult
2  26.000000       Adult
3  35.000000       Adult
4  35.000000       Adult
5  29.699118       Adult
6  54.000000       Adult
7   2.000000       Child

In [122]:
titanic_df['Age_cat']=titanic_df['Age'].apply(lambda x : 'Child' if x<=15 else ('Adult' if x<=60 else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Adult      786
Child       83
Elderly     22
Name: Age_cat, dtype: int64

In [124]:
def get_category(age):
    cat=''
    if age<=5 : cat='Baby'
    elif age<=35 : cat="Young"
    else : cat="Old"
        
    return cat

titanic_df['Age_cat']=titanic_df['Age'].apply(lambda x : get_category(x))
print(titanic_df[['Age','Age_cat']])

           Age Age_cat
0    22.000000   Young
1    38.000000     Old
2    26.000000   Young
3    35.000000   Young
4    35.000000   Young
..         ...     ...
886  27.000000   Young
887  19.000000   Young
888  29.699118   Young
889  26.000000   Young
890  32.000000   Young

[891 rows x 2 columns]